# 1장. 서울시 구별 CCTV 현황 분석
## 1-1. CCTV 현황과 인구 현황 데이터 구하기

In [5]:
import pandas as pd
import numpy as np

In [6]:
CCTV_Seoul = pd.read_csv('data/01. CCTV_in_Seoul.csv',  encoding='utf-8')
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

In [7]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [8]:
CCTV_Seoul.columns[0]

'기관명'

In [9]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0] : '구별'}, inplace=True)
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  2780       1292    430    584    932
1  강동구   773        379     99    155    377
2  강북구   748        369    120    138    204
3  강서구   884        388    258    184     81
4  관악구  1496        846    260    390    613

## 1-2. 엑셀파일 읽기 - 서울시 인구현황

In [10]:
pop_Seoul = pd.read_excel('data/01. population_in_Seoul.xls',  encoding='utf-8')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017.1/4,합계,4202888,10197604,5000005,5197599,9926968,4871560,5055408,270636,128445,142191,2.36,1321458
3,2017.1/4,종로구,72654,162820,79675,83145,153589,75611,77978,9231,4064,5167,2.11,25425
4,2017.1/4,중구,59481,133240,65790,67450,124312,61656,62656,8928,4134,4794,2.09,20764

In [11]:
pop_Seoul = pd.read_excel('data/01. population_in_Seoul.xls', 
                          header = 2,
                          usecols = 'B, D, G, J, N',
                          encoding='utf-8')
pop_Seoul.head()

   자치구           계        계.1       계.2   65세이상고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

In [12]:
pop_Seoul.rename(columns={pop_Seoul.columns[0] : '구별', 
                          pop_Seoul.columns[1] : '인구수', 
                          pop_Seoul.columns[2] : '한국인', 
                          pop_Seoul.columns[3] : '외국인', 
                          pop_Seoul.columns[4] : '고령자'}, inplace=True)
pop_Seoul.head()

    구별         인구수        한국인       외국인        고령자
0   합계  10197604.0  9926968.0  270636.0  1321458.0
1  종로구    162820.0   153589.0    9231.0    25425.0
2   중구    133240.0   124312.0    8928.0    20764.0
3  용산구    244203.0   229456.0   14747.0    36231.0
4  성동구    311244.0   303380.0    7864.0    39997.0

## 1-3. Pandas 기초

In [13]:
s = pd.Series([1,3,5,np.nan,6,8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [14]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [15]:
df = pd.DataFrame(np.random.randn(6,4), index=dates, 
                  columns=['A','B','C','D'])
df

                   A         B         C         D
2013-01-01 -0.954448  1.722622 -0.069212 -0.499691
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470 -1.822972 -0.409398
2013-01-04 -1.696333 -1.231402 -1.012924  0.760178
2013-01-05  0.481669  0.566634  0.968185 -0.128359
2013-01-06  1.262157  0.886141 -0.183269  1.356441

In [16]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [17]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [18]:
df.values

array([[-0.9544476 ,  1.72262193, -0.06921237, -0.49969125],
       [ 1.86841455,  0.5311017 ,  0.38140936,  0.43027049],
       [ 0.87480282,  0.1654695 , -1.82297151, -0.40939776],
       [-1.69633324, -1.23140213, -1.01292372,  0.76017764],
       [ 0.48166888,  0.56663352,  0.9681855 , -0.12835866],
       [ 1.26215745,  0.88614116, -0.18326903,  1.35644083]])

In [19]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
A    6 non-null float64
B    6 non-null float64
C    6 non-null float64
D    6 non-null float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [20]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.306044  0.440094 -0.289797  0.251574
std    1.364393  0.973391  0.996652  0.728968
min   -1.696333 -1.231402 -1.822972 -0.499691
25%   -0.595418  0.256878 -0.805510 -0.339138
50%    0.678236  0.548868 -0.126241  0.150956
75%    1.165319  0.806264  0.268754  0.677701
max    1.868415  1.722622  0.968185  1.356441

In [21]:
df.sort_values(by='B', ascending=False) # 내림차순

                   A         B         C         D
2013-01-01 -0.954448  1.722622 -0.069212 -0.499691
2013-01-06  1.262157  0.886141 -0.183269  1.356441
2013-01-05  0.481669  0.566634  0.968185 -0.128359
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470 -1.822972 -0.409398
2013-01-04 -1.696333 -1.231402 -1.012924  0.760178

In [22]:
df

                   A         B         C         D
2013-01-01 -0.954448  1.722622 -0.069212 -0.499691
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470 -1.822972 -0.409398
2013-01-04 -1.696333 -1.231402 -1.012924  0.760178
2013-01-05  0.481669  0.566634  0.968185 -0.128359
2013-01-06  1.262157  0.886141 -0.183269  1.356441

In [23]:
df['A']

2013-01-01   -0.954448
2013-01-02    1.868415
2013-01-03    0.874803
2013-01-04   -1.696333
2013-01-05    0.481669
2013-01-06    1.262157
Freq: D, Name: A, dtype: float64

In [24]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.954448  1.722622 -0.069212 -0.499691
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470 -1.822972 -0.409398

In [25]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470 -1.822972 -0.409398
2013-01-04 -1.696333 -1.231402 -1.012924  0.760178

In [26]:
df.loc[dates[0]]

A   -0.954448
B    1.722622
C   -0.069212
D   -0.499691
Name: 2013-01-01 00:00:00, dtype: float64

In [27]:
df.loc[:,['A','B']]

                   A         B
2013-01-01 -0.954448  1.722622
2013-01-02  1.868415  0.531102
2013-01-03  0.874803  0.165470
2013-01-04 -1.696333 -1.231402
2013-01-05  0.481669  0.566634
2013-01-06  1.262157  0.886141

In [28]:
df.loc['20130102':'20130104',['A','B']]

                   A         B
2013-01-02  1.868415  0.531102
2013-01-03  0.874803  0.165470
2013-01-04 -1.696333 -1.231402

In [29]:
df.loc['20130102',['A','B']]

A    1.868415
B    0.531102
Name: 2013-01-02 00:00:00, dtype: float64

In [30]:
df.loc[dates[0],'A']

-0.9544476045803719

In [31]:
df.iloc[3]

A   -1.696333
B   -1.231402
C   -1.012924
D    0.760178
Name: 2013-01-04 00:00:00, dtype: float64

In [32]:
df.iloc[3:5,0:2]

                   A         B
2013-01-04 -1.696333 -1.231402
2013-01-05  0.481669  0.566634

In [33]:
df.iloc[[1,2,4],[0,2]]

                   A         C
2013-01-02  1.868415  0.381409
2013-01-03  0.874803 -1.822972
2013-01-05  0.481669  0.968185

In [34]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470 -1.822972 -0.409398

In [35]:
df.iloc[:,1:3]

                   B         C
2013-01-01  1.722622 -0.069212
2013-01-02  0.531102  0.381409
2013-01-03  0.165470 -1.822972
2013-01-04 -1.231402 -1.012924
2013-01-05  0.566634  0.968185
2013-01-06  0.886141 -0.183269

In [36]:
df

                   A         B         C         D
2013-01-01 -0.954448  1.722622 -0.069212 -0.499691
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470 -1.822972 -0.409398
2013-01-04 -1.696333 -1.231402 -1.012924  0.760178
2013-01-05  0.481669  0.566634  0.968185 -0.128359
2013-01-06  1.262157  0.886141 -0.183269  1.356441

In [37]:
df[df.A > 0]

                   A         B         C         D
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470 -1.822972 -0.409398
2013-01-05  0.481669  0.566634  0.968185 -0.128359
2013-01-06  1.262157  0.886141 -0.183269  1.356441

In [38]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.722622       NaN       NaN
2013-01-02  1.868415  0.531102  0.381409  0.430270
2013-01-03  0.874803  0.165470       NaN       NaN
2013-01-04       NaN       NaN       NaN  0.760178
2013-01-05  0.481669  0.566634  0.968185       NaN
2013-01-06  1.262157  0.886141       NaN  1.356441

In [39]:
df2 = df.copy()

In [40]:
df2['E'] = ['one', 'one','two','three','four','three']
df2

                   A         B         C         D      E
2013-01-01 -0.954448  1.722622 -0.069212 -0.499691    one
2013-01-02  1.868415  0.531102  0.381409  0.430270    one
2013-01-03  0.874803  0.165470 -1.822972 -0.409398    two
2013-01-04 -1.696333 -1.231402 -1.012924  0.760178  three
2013-01-05  0.481669  0.566634  0.968185 -0.128359   four
2013-01-06  1.262157  0.886141 -0.183269  1.356441  three

In [41]:
df2['E'].isin(['two','four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [42]:
df2[df2['E'].isin(['two','four'])]

                   A         B         C         D     E
2013-01-03  0.874803  0.165470 -1.822972 -0.409398   two
2013-01-05  0.481669  0.566634  0.968185 -0.128359  four